Terraform will perform the following actions:

  # aws_organizations_account.mastery_math_dev will be updated in-place
  ~ resource "aws_organizations_account" "mastery_math_dev" {
        id                = "496750456511"
        name              = "Mastery Math Dev"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (8 unchanged attributes hidden)
    }

  # aws_organizations_account.mastery_math_prod will be updated in-place
  ~ resource "aws_organizations_account" "mastery_math_prod" {
        id                = "463718273094"
        name              = "Mastery Math Prod"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (8 unchanged attributes hidden)
    }

  # aws_organizations_account.mastery_math_stage will be updated in-place
  ~ resource "aws_organizations_account" "mastery_math_stage" {
        id                = "766623240526"
        name              = "Mastery Math Stage"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (8 unchanged attributes hidden)
    }

  # aws_organizations_account.mm_prod will be updated in-place
  ~ resource "aws_organizations_account" "mm_prod" {
        id                = "529386439094"
        name              = "Mastery Math Prod"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (8 unchanged attributes hidden)
    }

  # aws_organizations_account.mm_staging will be updated in-place
  ~ resource "aws_organizations_account" "mm_staging" {
      + close_on_deletion = true
      + create_govcloud   = false
        id                = "529386439094"
        name              = "Mastery Math Prod"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (6 unchanged attributes hidden)
    }

  # aws_organizations_account.mm_staging_real will be updated in-place
  ~ resource "aws_organizations_account" "mm_staging_real" {
        id                = "418537485217"
        name              = "Mastery Math Staging"
      ~ parent_id         = "ou-p2mx-6hyxrmrf" -> (known after apply)
        tags              = {}
        # (8 unchanged attributes hidden)
    }

  # aws_organizations_account.sghp_dev will be created
  + resource "aws_organizations_account" "sghp_dev" {
      + arn                        = (known after apply)
      + close_on_deletion          = true
      + create_govcloud            = false
      + email                      = "aws+sghp_dev@stemgarden.org"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "STEM Garden Homepage Dev"
      + parent_id                  = (known after apply)
      + role_name                  = "Admin"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # aws_organizations_account.sghp_prod will be created
  + resource "aws_organizations_account" "sghp_prod" {
      + arn                        = (known after apply)
      + close_on_deletion          = true
      + create_govcloud            = false
      + email                      = "aws+sghp_prod@stemgarden.org"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "STEM Garden Homepage Prod"
      + parent_id                  = (known after apply)
      + role_name                  = "Admin"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # aws_organizations_account.sghp_stage will be created
  + resource "aws_organizations_account" "sghp_stage" {
      + arn                        = (known after apply)
      + close_on_deletion          = true
      + create_govcloud            = false
      + email                      = "aws+sghp_stage@stemgarden.org"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "STEM Garden Homepage Stage"
      + parent_id                  = (known after apply)
      + role_name                  = "Admin"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # aws_organizations_organizational_unit.key_cloak will be created
  + resource "aws_organizations_organizational_unit" "key_cloak" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "KeyCloak"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.mastery_math must be replaced
-/+ resource "aws_organizations_organizational_unit" "mastery_math" {
      ~ accounts  = [
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/463718273094"
              - email = "mastery_math+prod@stemgarden.org"
              - id    = "463718273094"
              - name  = "Mastery Math Prod"
            },
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/496750456511"
              - email = "masterymath+dev@stemgarden.org"
              - id    = "496750456511"
              - name  = "Mastery Math Dev"
            },
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/418537485217"
              - email = "mm-staging@stemgarden.org"
              - id    = "418537485217"
              - name  = "Mastery Math Staging"
            },
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/766623240526"
              - email = "mastery_math+stage@stemgarden.org"
              - id    = "766623240526"
              - name  = "Mastery Math Stage"
            },
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/529386439094"
              - email = "masterymath@stemgarden.org"
              - id    = "529386439094"
              - name  = "Mastery Math Prod"
            },
        ] -> (known after apply)
      ~ arn       = "arn:aws:organizations::889823018333:ou/o-c2jf6qw1ou/ou-p2mx-6hyxrmrf" -> (known after apply)
      ~ id        = "ou-p2mx-6hyxrmrf" -> (known after apply)
        name      = "Mastery Math"
      ~ parent_id = "r-p2mx" # forces replacement -> (known after apply) # forces replacement
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
    }

  # aws_organizations_organizational_unit.projects will be created
  + resource "aws_organizations_organizational_unit" "projects" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Projects"
      + parent_id = "r-p2mx"
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.sandbox will be created
  + resource "aws_organizations_organizational_unit" "sandbox" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Sandbox"
      + parent_id = "r-p2mx"
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.stem_garden_homepage must be replaced
-/+ resource "aws_organizations_organizational_unit" "stem_garden_homepage" {
      ~ accounts  = [
          - {
              - arn   = "arn:aws:organizations::889823018333:account/o-c2jf6qw1ou/567953337802"
              - email = "sg-staging@stemgarden.org"
              - id    = "567953337802"
              - name  = "STEM Garden Website Staging"
            },
        ] -> (known after apply)
      ~ arn       = "arn:aws:organizations::889823018333:ou/o-c2jf6qw1ou/ou-p2mx-9w3b2mnl" -> (known after apply)
      ~ id        = "ou-p2mx-9w3b2mnl" -> (known after apply)
        name      = "STEM Garden Homepage"
      ~ parent_id = "r-p2mx" # forces replacement -> (known after apply) # forces replacement
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
    }

Plan: 8 to add, 6 to change, 2 to destroy.